## 1. 시계열 데이터

> Timestamp는 to_datetime()로 생성 가능하고, 날짜형태의 자료형을 시계열 타입으로 변환 <br>
> Period는 Timestamp(datetime) 객체를 다시 기간에 따른 자료형으로 이용할 때 사용

## 2. 자료형의 시계열 객체 변환 : to_datetime(), to_period()

In [1]:
import pandas as pd
df = pd.read_csv("C:/Users/User/Downloads/archive/individual_stocks_5yr/individual_stocks_5yr/A_data.csv")
df.head()

         date   open   high    low  close   volume Name
0  2013-02-08  45.07  45.35  45.00  45.08  1824755    A
1  2013-02-11  45.17  45.18  44.45  44.60  2915405    A
2  2013-02-12  44.81  44.95  44.50  44.62  2373731    A
3  2013-02-13  44.81  45.24  44.68  44.75  2052338    A
4  2013-02-14  44.72  44.78  44.36  44.58  3826245    A

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1259 non-null   object
 1   open    1259 non-null   float64
 2   high    1259 non-null   float64
 3   low     1259 non-null   float64
 4   close   1259 non-null   float64
 5   volume  1259 non-null   int64
 6   Name    1259 non-null   object
dtypes: float64(4), int64(1), object(2)
memory usage: 69.0+ KB

- to_datetime()으로 시계열 객체로 변환

df["new_Date"] = pd.to_datetime(df["date"])
print(df.head())
print("\n")
print(df.info())
print("\n")
print(type(df["new_Date"][0]))

In [5]:
df.drop("date",axis=1,inplace=True)
df.set_index("new_Date",inplace=True)

print(df.head())
print("\n")
print(df.info())

             open   high    low  close   volume Name
new_Date
2013-02-08  45.07  45.35  45.00  45.08  1824755    A
2013-02-11  45.17  45.18  44.45  44.60  2915405    A
2013-02-12  44.81  44.95  44.50  44.62  2373731    A
2013-02-13  44.81  45.24  44.68  44.75  2052338    A
2013-02-14  44.72  44.78  44.36  44.58  3826245    A


<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2013-02-08 to 2018-02-07
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   open    1259 non-null   float64
 1   high    1259 non-null   float64
 2   low     1259 non-null   float64
 3   close   1259 non-null   float64
 4   volume  1259 non-null   int64
 5   Name    1259 non-null   object
dtypes: float64(4), int64(1), object(1)
memory usage: 68.9+ KB
None

- Timestamp와 Period 차이

In [6]:
# Timestamp를 Period로 변환
dates = ["2014-01-01","2015-03-01","2021-06-01"]
ts_dates = pd.to_datetime(dates)
print(ts_dates)
print("\n")

DatetimeIndex(['2014-01-01', '2015-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [8]:
# Timestamp를 Period 변환
pr_day = ts_dates.to_period(freq="D") # 1일의 기간
print(pr_day)
pr_month = ts_dates.to_period(freq='M') #1개월의 기간
print(pr_month)
pr_year = ts_dates.to_period(freq='A')  #1년의 기간
print(pr_year)

PeriodIndex(['2014-01-01', '2015-03-01', '2021-06-01'], dtype='period[D]', freq='D')
PeriodIndex(['2014-01', '2015-03', '2021-06'], dtype='period[M]', freq='M')
PeriodIndex(['2014', '2015', '2021'], dtype='period[A-DEC]', freq='A-DEC')

- Period 객체는 to_period(freq="기간인수")로 datetime 변수에 대해 어떤 기간에 따른 자료형을 생성하고자 할 떄 주로 사용

## 3. 시계열 데이터 만들기
- date_range(), period_range()

### 3-1. Timestamp 배열

- date_range()는 range() 함수와 비슷한 개념

In [9]:
import pandas as pd

ts_ms = pd.date_range(start = "2019-01-01",  # 날짜 범위 시작
                      end = None,            # 날짜 범위 끝
                      periods = 6,           # 생성할 Timestamp 개수
                      freq = "MS",           # 시간 간격(MS : 월의 시작일)
                      tz = "Asia/Seoul")     # 시간대(timezone)
print(ts_ms)

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [10]:
ts_me = pd.date_range('2019-01-01',
                     periods = 6,
                     freq = 'M',            #1개월 간격, 월의 마지막날 기준
                     tz = 'Asia/Seoul')   
print(ts_me)
print('\n')


ts_3m = pd.date_range('2019-01-01',
                     periods = 6,
                     freq = '3M',           # 3개월 간격, 월의 마지막 날 기준
                     tz = 'Asia/Seoul')
print(ts_3m)
print('\n')

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')


DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

### 3-2. Period 배열

- period_range()

In [11]:
# 1개월 길이
pr_m = pd.period_range(start = '2019-01-01',
                   	   end = None,
                       periods = 3,
                       freq = 'M')           
print(pr_m)
print('\n')

# 1시간 길이
pr_h = pd.period_range(start = '2019-01-01',
                       end = None,
                       periods = 3,
                       freq = 'H')           
print(pr_h)
print('\n')

# 2시간 길이
pr_2h = pd.period_range(start = '2019-01-01',
                        end = None,
                        periods = 3,
                        freq = '2H')          
print(pr_2h)

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]', freq='M')


PeriodIndex(['2019-01-01 00:00', '2019-01-01 01:00', '2019-01-01 02:00'], dtype='period[H]', freq='H')


PeriodIndex(['2019-01-01 00:00', '2019-01-01 02:00', '2019-01-01 04:00'], dtype='period[2H]', freq='2H')

## 4. 시계열 데이터 활용

### 4-1. 날짜 데이터 분리 : dt.year, dt.month, dt.day

In [12]:
import pandas as pd
df = pd.read_csv("C:/Users/User/Downloads/archive/individual_stocks_5yr/individual_stocks_5yr/A_data.csv")
df["new_Date"] = pd.to_datetime(df["date"])
df.head()

         date   open   high    low  close   volume Name   new_Date
0  2013-02-08  45.07  45.35  45.00  45.08  1824755    A 2013-02-08
1  2013-02-11  45.17  45.18  44.45  44.60  2915405    A 2013-02-11
2  2013-02-12  44.81  44.95  44.50  44.62  2373731    A 2013-02-12
3  2013-02-13  44.81  45.24  44.68  44.75  2052338    A 2013-02-13
4  2013-02-14  44.72  44.78  44.36  44.58  3826245    A 2013-02-14

In [13]:
df['Year'] = df['new_Date'].dt.year
df['Month'] = df['new_Date'].dt.month
df['Day'] = df['new_Date'].dt.day
df.head()

,date,open,high,low,close,volume,Name,new_Date,Year,Month,Day
0,2013-02-08,45.07,45.35,45.00,45.08,1824755,A,2013-02-08,2013,2,8
1,2013-02-11,45.17,45.18,44.45,44.60,2915405,A,2013-02-11,2013,2,11
2,2013-02-12,44.81,44.95,44.50,44.62,2373731,A,2013-02-12,2013,2,12
3,2013-02-13,44.81,45.24,44.68,44.75,2052338,A,2013-02-13,2013,2,13
4,2013-02-14,44.72,44.78,44.36,44.58,3826245,A,2013-02-14,2013,2,14

In [14]:
df['Date_yr'] = df['new_Date'].dt.to_period(freq = 'A')  # 연도까지
df['Date_m'] = df['new_Date'].dt.to_period(freq = 'M')   # 연월까지
df.head()

,date,open,high,low,close,volume,Name,new_Date,Year,Month,Day,Date_yr,Date_m
0,2013-02-08,45.07,45.35,45.00,45.08,1824755,A,2013-02-08,2013,2,8,2013,2013-02
1,2013-02-11,45.17,45.18,44.45,44.60,2915405,A,2013-02-11,2013,2,11,2013,2013-02
2,2013-02-12,44.81,44.95,44.50,44.62,2373731,A,2013-02-12,2013,2,12,2013,2013-02
3,2013-02-13,44.81,45.24,44.68,44.75,2052338,A,2013-02-13,2013,2,13,2013,2013-02
4,2013-02-14,44.72,44.78,44.36,44.58,3826245,A,2013-02-14,2013,2,14,2013,2013-02

### 4-2. 날짜 인덱스 활용

In [15]:
import pandas as pd
df = pd.read_csv("C:/Users/User/Downloads/archive/individual_stocks_5yr/individual_stocks_5yr/A_data.csv")
df["new_Date"] = pd.to_datetime(df["date"])
df.set_index("new_Date",inplace=True)
df.head()

                  date   open   high    low  close   volume Name
new_Date
2013-02-08  2013-02-08  45.07  45.35  45.00  45.08  1824755    A
2013-02-11  2013-02-11  45.17  45.18  44.45  44.60  2915405    A
2013-02-12  2013-02-12  44.81  44.95  44.50  44.62  2373731    A
2013-02-13  2013-02-13  44.81  45.24  44.68  44.75  2052338    A
2013-02-14  2013-02-14  44.72  44.78  44.36  44.58  3826245    A

In [16]:
print(df.loc["2013-02"])

                  date   open    high     low  close    volume Name
new_Date
2013-02-08  2013-02-08  45.07  45.350  45.000  45.08   1824755    A
2013-02-11  2013-02-11  45.17  45.180  44.450  44.60   2915405    A
2013-02-12  2013-02-12  44.81  44.950  44.500  44.62   2373731    A
2013-02-13  2013-02-13  44.81  45.240  44.680  44.75   2052338    A
2013-02-14  2013-02-14  44.72  44.780  44.360  44.58   3826245    A
2013-02-15  2013-02-15  43.48  44.240  42.210  42.25  14657315    A
2013-02-19  2013-02-19  42.21  43.120  42.210  43.01   4116141    A
2013-02-20  2013-02-20  42.84  42.850  42.225  42.24   3873183    A
2013-02-21  2013-02-21  42.14  42.140  41.470  41.63   3415149    A
2013-02-22  2013-02-22  41.83  42.070  41.580  41.80   3354862    A
2013-02-25  2013-02-25  42.09  42.220  41.290  41.29   3622460    A
2013-02-26  2013-02-26  40.62  41.290  40.190  40.97   6185811    A
2013-02-27  2013-02-27  40.99  41.905  40.830  41.73   3564385    A
2013-02-28  2013-02-28  41.78  42.060  41.450  41.48   3464202    A

### 4-3. 오늘과의 날짜 차이 열 만들기

In [17]:
today = pd.to_datetime("2013-03-11")
df["time_delta"] = today - df.index
df.head()

                  date   open   high    low  close   volume Name time_delta
new_Date
2013-02-08  2013-02-08  45.07  45.35  45.00  45.08  1824755    A    31 days
2013-02-11  2013-02-11  45.17  45.18  44.45  44.60  2915405    A    28 days
2013-02-12  2013-02-12  44.81  44.95  44.50  44.62  2373731    A    27 days
2013-02-13  2013-02-13  44.81  45.24  44.68  44.75  2052338    A    26 days
2013-02-14  2013-02-14  44.72  44.78  44.36  44.58  3826245    A    25 days

### 4-4. 오늘날짜 : datetime 모듈

In [18]:
import datetime
now = datetime.datetime.now()

In [19]:
print(now)
print(now.year)
print(now.month)
print(now.day)
print(now.hour)
print(now.minute)
print(now.second)
print("%s-%s-%s" % (now.year,now.month,now.day))

2022-04-02 21:09:39.849350
2022
4
2
21
9
39
2022-4-2